       IDENTIFICATION DIVISION.
       PROGRAM-ID. LOGIN.
       PROCEDURE DIVISION.
              DISPLAY "Welcome to COBOL ATM Login".
       STOP RUN.
